# RotateAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstanceCreationData..::..RotateAngle Property
FamilyInstanceCreationData Class See Also
---
Get or set the rotate angle of the FamilyInstance
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double RotateAngle { get; set; }
```

Visual Basic
---
```text
Public Property RotateAngle As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double RotateAngle {
	double get ();
	void set (double value);
}
```

# Remarks
The FamilyInstance will rotate this angle when the instance is created.
# See Also
FamilyInstanceCreationData Class
Autodesk.Revit.Creation Namespace